Repository: iamLuCat/ofeka_earth
Catalog: lib/l10n/app_*.arb
Languages: ja, pt

source: Play
ja: プレー
pt: Jogar

# make_donation
source: Donation
ja: 寄付をする
pt: Doações

source: Options
ja: オプション
pt: Opções

source: Quit
ja: 出口
pt: Sair

source: Select your language
ja: 言語を選択
pt: Selecione seu idioma

source: Language
ja: 言語
pt: Idioma

# ofeka_hearth
source: Ofeka Earth
ja: 土地を大切にする

# dialogue1
source: Ngola: Mayouma, what brings you here?
ja: Ngola: マヨーマ、どうしてここに？
pt: Ngola: Mayouma, O que te trás por cá?

# dialogue2
source: Mayouma: It's urgent, Ngola. Our village, Iona, is facing a serious threat - a relentless shift in climate change. Our rivers are drying up, our trees are withering.
ja: Mayouma: 緊急事態だ、ンゴラ。私たちの村、イオナは深刻な脅威に直面しています。気候変動の容赦ない猛攻撃です。川は干上がり、木々は枯れ、人々は危機に瀕しています。
pt: Mayouma: É urgente, Ngola. A nossa aldeia, Iona, enfrenta uma séria ameaça - uma mudança implacável das alterações climáticas. Os nossos rios estão a secar, as nossas árvores a murcha

# dialogue3
source: Ngola: I sense a change in climate change. What needs to be done?
ja: Ngola: 要素に不安を感じる。何が必要ですか？
pt: Ngola: Sinto uma mudança nas alterações climaticas. O que é que tem de ser feito?

# dialogue4
source: Mayouma: You, Ngola, are our beacon of hope. You must embark on a mission to protect Iona from the ravages of climate change. Plant new trees to restore our forests, revitalize our rivers to ensure our survival, and educate our people about the perils we face.
ja: Mayouma: あなた、ンゴラは私たちの希望の光です。気候変動の脅威からイオナを守る使命に乗り出すのだ。森を回復させるために新しい木を植え、私たちの生存を保証するために川を活性化させ、私たちが直面している危険について人々を教育するのです。
pt: Mayouma: Tu, Ngola, és o nosso farol de esperança. Tens de embarcar numa missão para proteger Iona dos estragos das alterações climáticas. Planta novas árvores para restaurar as nossas florestas, revitaliza os nossos rios para garantir a nossa sobrevivência e educar o nosso povo sobre os perigos que enfrentamos.

# dialogue5
source: Ngola: I accept this sacred duty. But how can I accomplish such a monumental task alone?
ja: Ngola: この神聖な任務は引き受けます。しかし、このような大仕事を私一人で成し遂げられるでしょうか？
pt: Ngola: Eu aceito este dever sagrado. Mas como é que posso cumprir sozinho uma tarefa tão monumental?

# dialogue6
source: Mayouma: You will not be alone, Ngola. The spirits of our ancestors will guide you, and the resilience of our people will support you. Seek out knowledge from the wise, and inspire others to join our cause.
ja: Mayouma: 君は一人じゃないよ、ンゴラ。先祖の魂があなたを導き、私たちの民の回復力があなたを支えてくれる。賢者から知識を求め、他の人々を鼓舞し、我々の大義に参加させるのだ。
pt: Mayouma: Tu não estarás sozinha, Ngola. Os espíritos dos nossos antepassados vão guiar-te e a resiliência do nosso povo vai apoiar-te. Procura o conhecimento dos sábios e inspira outros a juntarem-se à nossa causa.

# dialogue7
source: Ngola: I shall heed your call, Mayouma. The fate of Iona rests in my hands.
ja: Ngola: あなたの呼びかけに応えよう、マヨーマ。イオナの運命は私の手に委ねられている。
pt: Ngola: Eu vou atender ao teu apelo, Mayouma. O destino de Iona está nas minhas mãos.

# dialogue8
source: Mayouma: Go forth, Ngola, and may the spirits watch over you.
ja: Mayouma: 行きなさい、ンゴラ。精霊たちがあなたを見守っていますように。
pt: Mayouma: Vai em frente, Ngola, e que os espíritos olhem por ti.

# message_tree
source: Tree replaced, Trees are important for the health of the planet. Keep planting and protecting trees for a greener future.
ja: 植え替えられた木、木は地球の健康のために重要です。より緑豊かな未来のために、木を植え、守り続けましょう。
pt: Árvore substituída, As árvores são importantes para a saúde do planeta. Continue a plantar e a proteger as árvores para um futuro mais verde.

# hints
source: Tips
ja: ディカス
pt: Dicas

source: Close
ja: フェシャル
pt: Fechar

source: Pause Menu
ja: ポーズ
pt: Pause

# back_game
source: Back to game
ja: 試合に戻る
pt: Voltar ao jogo

# back_menu
source: Back to menu
ja: スタートメニューに戻る
pt: Voltar ao menu

# donationsbar
source: DONATIONS
ja: 寄付金
pt: DOAÇÕES

source: Game Shop
ja: ロハ
pt: Loja

source: SHOP
ja: ショップ
pt: LOJA

source: MAKE YOUR DONATION
ja: 寄付をする
pt: FAÇA SUA DOAÇÃO

source: SHOP PAGE
ja: ショップページ
pt: Loja

# shop_page_title
source: This is the store of our application, here you could buy supplements for the village, improve your skills and customize your character (UNDER DEVELOPMENT)
ja: このアプリのショップでは、村のサプリメントを購入したり、スキルを向上させたり、キャラクターをカスタマイズすることができます（開発中）。
pt: Está é a loja de nossa aplicação, aqui você poderá comprar suplementos para aldeia, melhorar suas hablidades e personalizar o seu personagem (EM DESENVOLVIMENTO)

source: SOCIAL CAUSES
ja: 社会的原因
pt: CAUSAS SOCIAIS

# t1
source: Hi, and welcome to the Ofeka Earth Project!
ja: オフェカ・アース・プロジェクトへようこそ！
pt: Olá! Bem vindo(a) ao projeto Ofeka Earth!

# t2
source: We invite you to join us in the fight for a more sustainable future.
ja: より持続可能な未来のために、私たちと一緒に戦いましょう。
pt: Junta-te a nós, na luta por um futuro mais sustentável.

# t3
source: Please follow the instructions of our game, and take the chance to learn a little about the Iona region.
ja: ゲームの指示に従って、イオナ地域について少し学んでください。
pt: Segue as instruções do nosso jogo, e aproveita para aprenderes um pouco acerca da região do Iona..

# t4
source: MAKE YOUR DONATION
ja: 寄付をする
pt: FAÇA SUA DOAÇÃO

# t5
source: View all information
ja: すべての情報を見る
pt: Ver toda a informação

# t6
source: The Village Of Iona is located in the southern region of Namibe, a province of the Republic of Angola. This entire region of the African continent, faces desertification due to deforestation, unsustainable agricultural practices and climate change. The lack of rainfall and arid soils is putting the lives of local communities at risk, since they rely a lot on cattle breeding as part of their culture and, as a consequence, have to walk long distances in search of pasture. This poses serious threats to their lives in many different ways: low food reserves, malnutrition, deseases and illiteracy because children are kept out of school to help with cattle breading. There is an urgent need to promote reforestation, sustainable agricultural practices, and access to clean water, and Ngola needs you to prevent the effects of drought and help the communities of Iona to overcome these challenges.
ja: イオナ村は、アンゴラ共和国のナミベ州南部に位置する。アフリカ大陸の南部に位置するこの地域一帯は、伐採、持続不可能な農法、気候変動によって引き起こされた深刻な砂漠化に直面している。雨の不足と乾燥した土壌は、牧畜を文化としている地域住民の生活を脅かし、その結果、牧草地を求めて長い距離を歩かなければならなくなっている。このような状況は、食糧備蓄の減少、栄養失調、病気、牧畜を優先した学校欠席による非識字など、さまざまな形で彼らの生活を脅かしてい 。森林再生、持続可能な農法、飲料水へのアクセスを促進することが急務であり、だからこそンゴラは干ばつの影響を防ぎ、イオナの人々がこれらの制約を克服できるよう支援する必要がある。
pt: A vila do Iona localiza-se na região sul do Namibe, uma província da Republica de Angola. Toda essa região, situada no Sul do continente Africano enfrenta uma grave desertificação causadhepelo abate de árvores, práticas agrícolas insustentáveis, e mudanças climáticas. A escassez de chuva e os solos áridos constituem uma ameaça à vida das comunidades, que dependem da criação de gado como parte da sua cultura e, como consequência, têm que caminhar longas distâncias em busca de pasto. Esta situação ameaça as suas vidas de várias formas: fracas reservas alimentares, má nutrição, doenças e analfabetismo provocado pelo absentismo escolar em beneficio da pastoricia. É urgente que se promova a reflorestação, práticas agrícolas sustentáveis, e o acesso à água potável, e por isso a Ngola precisa de ti prevenir os efeitos da Seca e apoiar a população do Iona a ultrapassar esses constrangimentos.

# t7
source: Plastic is invading schools, neighbourhoods, beaches and rivers in Angola. Local people need to become aware of the consequences, and engage themselves in the quest to reduce this environmental threat. Help us make a difference! With just 1 USD, you can support our campaign to help children in need and receive a leaflet, t-shirt or other gift in exchange. Join us in the fight against plastic pollution and in promoting the education and well-being of angolan children. Every contribution counts. Join us today!
ja: アンゴラでは、プラスチックが学校、地域、海岸、河川に侵入している。アンゴラ国民はその結果について学び、環境の脅威を減らすためのミッションに参加する必要があります。ンゴラと彼女の友人たちが変化を起こすのを助けてください！たった1米ドルで、困っている子供たちを支援する私たちのキャンペーンを支援することができ、その見返りとしてパンフレットやTシャツなどの記念品を受け取ることができます。私たちと一緒にプラスチック汚染と闘い、教育と福祉を推進しましょう。少しずつの積み重ねが大切です。今すぐご参加ください。
pt: O Plástico esta a invadir escolas, bairros, praiais e rios em Angola. A população precisa de aprender sobre as consequências, e envolver-se numa missão para a redução de ameaças ambientais. Ajuda a Ngola e seus amigos a fazer a diferença! Com apenas 1 USD, podes apoiar a nossa campanha para apoiar as crianças carentes e em troca receber uma brochura, uma t-shirt ou outra recordação. Junta-te a nós na luta contra a poluição provocada pelo plástico, e a promover a educação e o bem-estar. Toda a ajuda conta. Junta-te hoje mesmo.

# t8
source: Deforestation in Angola is not happening just due to natural causes: There is a battle that we need to fight, against the cutting and burning of trees, which is being done to increase agricultural fields and to produce coal. Join Us to Protect Our Trees And Prevent threatned areas from this massive deforestation! Cutting And Burning Trees Threatens Our Environment And Directly Impacts Vulnerable Communities. With Your Help, We Can Make A Difference: Contribute To Our Campaign Today, And Help Preserve Forests While Supporting Communities In Need. Together, We Can Build A Greener, More Sustainable Future For Everyone.
ja: アンゴラでは、プラスチックが学校、地域、海岸、河川に侵入している。アンゴラ国民はその結果について学び、環境の脅威を減らすためのミッションに参加する必要があります。ンゴラと彼女の友人たちが変化を起こすのを助けてください！たった1米ドルで、困っている子供たちを支援する私たちのキャンペーンを支援することができ、その見返りとしてパンフレットやTシャツなどの記念品を受け取ることができます。私たちと一緒にプラスチック汚染と闘い、教育と福祉を推進しましょう。少しずつの積み重ねが大切です。今すぐご参加ください。
pt: A desflorestaçao em Angola não acontece apenas devido a causas naturais: precisamos travar uma grande batalha, contra o abate e a queima de arvores para aumentar os campos de cultivo e para produzir carvão. Junta-te a nós para proteger as árvores e proteger áreas ameaçadas desta desflorestacao en massa. O corte e a queima de árvores ameaça o meio ambiente tem impacto direto em comunidades vulneráveis. Com a tua ajuda, podemos fazer a diferença: contribui para a nossa campanha hoje, e ajuda a proteger as Florestas enquanto apoiamos comunidades carentes. Juntos, podemos construir um futuro mais verde e sustentável para todos.
